/* Localized versions of UI keys */

/* generic */
"OKButtonText" = "OK";
"CancelButtonText" = "Cancel";
"QuitButtonText" = "Quit";
"DontQuitButtonText" = "Don’t Quit";
"DontCloseButtonText" = "Don’t Close";
"ChooseDirectoryOKButton" = "Select";
"DontShowWarningAgainCheckboxLabel" = "Don’t show this warning again";

"AlreadyRunningAlert" = "Cannot Launch %@";
"AlreadyRunningMsg" = "%@ is already running on this system. Only one copy can be run at a time.";

"StartupFailureAlert" = "Cannot Launch %@";
"StartupFailureMsg" = "An error occurred which prevents %@ from running.";
"StartupFailureBinPathMsg" = "An error occurred which prevents %@ from running (could not get path to executable).";
"StartupFailureInitEmbeddingMsg" = "An error occurred which prevents %@ from running (failed to initialize layout engine).";
"StartupFailureProfilePathMsg" = "An error occurred which prevents %@ from running (could not get profile location).";
"StartupFailureProfileSetupMsg" = "An error occurred which prevents %@ from running (failed to set up profile location).";
"StartupFailureNoPrefsMsg" = "An error occurred which prevents %@ from running (failed to set up preferences).";

"ProblematicAddOnWarningTitle" = "Unsupported Add-Ons Detected";
"ProblematicAddOnWarningMessage" = "The following unsupported third-party add-ons are currently installed:\n\t%1$@\n\nSome versions of these add-ons are known to be incompatible with current versions of Camino and could cause serious problems, including crashes and inability to open web pages. The versions you are using may not have been tested with Camino %2$@, and may cause Camino to behave incorrectly.\n\nIf you experience any problems with Camino, please try uninstalling these add-ons.";

/* Restoring saved session after crash dialog */
"RestoreAfterCrashTitle" = "Restore previous pages?";
"RestoreAfterCrashMessage" = "Your last Camino session closed unexpectedly.  Would you like to restore the web pages you were previously viewing?";
"RestoreAfterCrashActionButton" = "Restore Pages";
"RestoreAfterCrashCancelButton" = "Don’t Restore";

/* close multiple tabs */
"CloseWindowWithMultipleTabsMsg" = "Are you sure you want to close this window?";
"CloseWindowWithMultipleTabsExplFormat" = "You have %u tabs open. If you close the window, you will lose any information that you entered in those tabs.";
"CloseWindowWithMultipleTabsButton" = "Close Window";

/* close multiple windows */
"CloseMultipleWindowsMsg" = "Are you sure you want to close all windows?";
"CloseMultipleWindowsExpl" = "You have %u windows open. If you close these windows, you will lose any information that you entered in them.";
"CloseMultipleWindowsAndTabsExpl" = "You have %1$u windows open, containing a total of %2$u tabs. If you close these windows, you will lose any information that you entered in them.";
"CloseWindowsButtonText" = "Close Windows";

/* quit multiple windows/tabs */
"QuitWithMultipleWindowsMsg" = "Are you sure you want to quit when there are multiple open windows?";
"QuitWithMultipleWindowsExpl" = "You have %u windows open. If you quit now, you will lose any information that you entered in those windows.";
"QuitWithMultipleWindowsAndTabsExpl" = "You have %1$u windows open, containing a total of %2$u tabs. If you quit now, you will lose any information that you entered in those windows.";
"QuitWithMultipleTabsMsg" = "Are you sure you want to quit when there are multiple tabs open?";
"QuitWithMultipleTabsExpl" = "You have %u tabs open. If you quit now, you will lose any information that you entered in those tabs.";

/* for toggling show/hide bookmarks toolbar menu item */
"Hide Bookmarks Toolbar" = "Hide Bookmark Bar";
"Show Bookmarks Toolbar" = "Show Bookmark Bar";

/* For toggling show/hide status bar menu item */
"HideStatusBar" = "Hide Status Bar";
"ShowStatusBar" = "Show Status Bar";

"HideBookmarkManager" = "Hide Bookmark Manager";
"ShowBookmarkManager" = "Show Bookmark Manager";

"ShowTabThumbnailView" = "Show Tab Overview";
"HideTabThumbnailView" = "Hide Tab Overview";

"GoOnline" = "Go Online";
"WorkOffline" = "Work Offline";

/* offline window title (unused) */
"OfflineTitleFormat" = "%@ [Working Offline]";

/* Default browser dialog */
"DefaultBrowserTitle" = "Set Camino as your default browser?";
"DefaultBrowserMessage" = "The default browser is the browser that will open when you click on links in other applications, such as Mail. You can change the default browser in the Preferences if you want to.";
"DefaultBrowserChecboxTitle" = "Don’t ask me again";
"DefaultBrowserAcceptButton" = "Set as Default Browser";
"DefaultBrowserDenyButton" = "Don’t Set";

/* quit with downloads alert */
"QuitWithDownloadsMsg" = "Are you sure you want to quit?";
"QuitWithDownloadsExpl" = "There are downloads in progress that will be stopped if you quit now.";

/* feed detection */
"Select..." = "Select…";
"NoDefaultReader" = "None";
"FeedDetected" = "List feeds offered by this page";
"SubscribeTo" = "Subscribe to “%@”";
"FeedPreferences" = "Feed Preferences…";
"FeedAppDoesNotExistExplanation" = "There is no feed reader selected. Please choose an application to handle feeds.";

/* title for untitled pages */
"UntitledPageTitle" = "Untitled";

/* prefix of tabs and windows showing source */
"SourceOf" = "Source of %@";

/* "Loading" message for tab labels */
"TabLoading" = "Loading…";

/* Preferences window */
"PrefsWindowTitleFormat" = "%@ Preferences";
"Loading %@..." = "Loading %@…";

/* About window */
"AboutWindowTitleFormat" = "About %@";

/* Save dialog */
"HTMLCompleteFolderSuffixString" = "%@ Files";

/* Downloads window buttons */
"dlRemoveButtonLabel" = "Remove";
"dlRevealButtonLabel" = "Show";
"dlOpenButtonLabel" = "Open";
"dlCancelButtonLabel" = "Cancel";
"dlCleanUpButtonLabel" = "Clean Up";
"dlPauseButtonLabel" = "Pause";
"dlResumeButtonLabel" = "Resume";
"dlTrashButtonLabel" = "Trash";

"dlRemoveButtonTooltip" = "Remove selected item from the list";
"dlRemoveButtonTooltipPlural" = "Remove selected items from the list";
"dlRevealButtonTooltip" = "Show selected file in Finder";
"dlRevealButtonTooltipPlural" = "Show selected files in Finder";
"dlOpenButtonTooltip" = "Open selected file";
"dlOpenButtonTooltipPlural" = "Open selected files";
"dlCancelButtonTooltip" = "Cancel selected download";
"dlCancelButtonTooltipPlural" = "Cancel selected downloads";
"dlPauseButtonTooltip" = "Pause selected download";
"dlPauseButtonTooltipPlural" = "Pause selected downloads";
"dlResumeButtonTooltip" = "Resume selected download";
"dlResumeButtonTooltipPlural" = "Resume selected downloads";
"dlTrashButtonTooltip" = "Move selected file to Trash";
"dlTrashButtonTooltipPlural" = "Move selected files to Trash";
"dlCleanUpButtonTooltip" = "Remove all inactive items from the list";

/* Downloads contextual menus */
"dlRemoveCMLabel" = "Remove";
"dlRevealCMLabel" = "Show in Finder";
"dlOpenCMLabel" = "Open";
"dlCancelCMLabel" = "Cancel";
"dlCopySourceURLCMLabel" = "Copy Source URL";
"dlPauseCMLabel" = "Pause";
"dlResumeCMLabel" = "Resume";
"dlTrashCMLabel" = "Move to Trash";

/* Downloads window status */
"DownloadLabelString" = "Downloading “%@” to “%@”";
"DownloadDoneLabelString" = "Downloaded “%@” to “%@”";
"DownloadPausedStatusString" = "Paused at %@ of %@";
"DownloadStatusString" = "%@ of %@ (at %@/sec)";
"DownloadDoneStatusString" = "%@ of %@ done (at %@/sec)";
"DownloadCompleted" = "Completed in %@ (%@)";
"DownloadCancelled" = "Canceled";
"DownloadInterrupted" = "Interrupted";
"DownloadCalculatingString" = "Unknown";
"DownloadRemainingLabel" = "Time remaining:";
"DownloadRemainingLabelDone" = "Time elapsed:";
"DownloadingTooltipFormat" = "Downloading %@\n\t%@\n\t%@";
"DownloadedTooltipFormat" = "Downloaded %@\n\t%@\n\t%@";
"UnderSec" = "Under %d seconds";
"UnderMin" = "Under a minute";
"AboutMin" = "About a minute";
"AboutMins" = "About %d minutes";
"AboutHour" = "Over an hour";
"AboutHours" = "Over %d hours";
"LabelString" = "%@ of %@ (at %@/sec)";

"BytesDownloadLabel" = "bytes";
"KilobytesDownloadLabel" = "KB";
"MegabytesDownloadLabel" = "MB";
"GigabytesDownloadLabel" = "GB";

/* Downloading errors */
"DownloadErrorMsgFmt" = "There was an error downloading the file “%@”";
"DownloadErrorNoDiskSpaceOnVolumeFmt" = "The download failed because the volume “%@” has run out of disk space.";
"DownloadErrorDestinationWriteProtectedFmt" = "The download failed because you do not have write permissions in the destination folder “%@”.";
"DownloadErrorHTMLCompleteFolderIsFileFmt" = "Camino cannot create the folder “%1$@” because a file with the same name already exists in “%2$@”.";
"DownloadErrorOther" = "The download failed. Check your network connectivity and the download folder, and try again.";

/* Keychain items */
"KeychainLabelFormat" = "%1$@ (%2$@)";
"WebFormPassword" = "Web form password";

/* for Keychain prompts */
"KeychainCheckTitle" = "Store this password in the Keychain";

"KeychainStoreAlertTitle" = "Save this password in your Keychain?";
"KeychainStoreAlertText" = "Saving this password allows Camino to fill it in when you return to this website. Use the Keychain Access application to reverse this decision or change the entry. Selecting “Never Save for this Website” is useful for shared computers or public labs.";
"KeychainStoreAlertStoreButton" = "Save Password";
"KeychainStoreAlertDontStoreButton" = "Don’t Save";
"KeychainStoreAlertNeverStoreButton" = "Never Save for this Website";

"KeychainUpdateAlertTitle" = "Update your Keychain with new information?";
"KeychainUpdateAlertText" = "The username or password you entered for this website differs from the information saved in your Keychain.";
"KeychainUpdateAlertUpdateButton" = "Save New Values";
"KeychainUpdateAlertDontUpdateButton" = "Keep Old Values";

/* Browser Toolbar Buttons */

/* Button Labels */
"Back" = "Back";
"Forward" = "Forward";
"Reload" = "Reload";
"Stop" = "Stop";
"Home" = "Home";
"Location" = "Location";
"Bookmarks" = "Bookmarks";
"Manage Bookmarks" = "Manage Bookmarks";
"Print" = "Print";
"View Source" = "View Source";
"Bookmark" = "Bookmark";
"NewTab" = "New Tab";
"CloseTab" = "Close Tab";
"BigText" = "Bigger Text";
"SmallText" = "Smaller Text";
"BigPage" = "Zoom In";
"SmallPage" = "Zoom Out";
"SendLink" = "Email Location";
"Downloads" = "Downloads";
"Fill Form" = "Fill Form";
"ShowHistory" = "History";
"TabOverview" = "Tab Overview";

/* Customize Sheet Labels (where different) */
"Go Back" = "Go Back";
"Go Forward" = "Go Forward";
"Reload Page" = "Reload Page";
"Stop Loading" = "Stop Loading";
"Go Home" = "Go Home";
"Progress" = "Progress";
"View Page Source" = "View Page Source";
"Bookmark Page" = "Bookmark Page";
"SendLinkPaletteLabel" = "Email Page Location";
"ScriptItem" = "Script";

/* Button Tooltips */
"BackToolTipFormat" = "Go back to “%1$@”\n—\n%2$@";        /* 1=title, 2=url */
"ForwardToolTipFormat" = "Go forward to “%1$@”\n—\n%2$@";  /* 1=title, 2=url */
"BackToolTip" = "Go back one page"; /* for disabled button */
"ForwardToolTip" = "Go forward one page"; /* for disabled button */
"ReloadToolTip" = "Reload this page";
"StopToolTip" = "Stop loading this page";
"HomeToolTip" = "Go to your home page";
"ShowBookmarkMgrToolTip" = "Show bookmark manager";
"HideBookmarkMgrToolTip" = "Hide bookmark manager";
"PrintToolTip" = "Print this page";
"ViewSourceToolTip" = "Display the HTML source of this page";
"BookmarkToolTip" = "Add this page to your bookmarks";
"NewTabToolTip" = "Create a new tab";
"CloseTabToolTip" = "Close this tab";
"BigTextToolTip" = "Enlarge the text on this page";
"SmallTextToolTip" = "Shrink the text on this page";
"BigPageToolTip" = "Enlarge the content on this page";
"SmallPageToolTip" = "Shrink the content on this page";
"SendLinkToolTip" = "Open a new message in your mail program with the location of this page";
"DownloadsToolTip" = "Show the Downloads window";
"FillFormToolTip" = "Fill fields on this page with your Address Book information";
"ShowHistoryToolTip" = "Show recently visited pages";
"ShowTabOverviewToolTip" = "Show Tab Overview";
"HideTabOverviewToolTip" = "Hide Tab Overview";
"ScriptItemToolTipFormat" = "Run script “%@”";

/* Alternate menu items for Reload */
"Force Format" = "Force %@";

"BookmarkButtonTooltipFormat" = "%1$@\n—\n%2$@";  /* 1=title, 2=url */

/* Tabs widget */
"CloseTabButtonDescription" = "close tab";  /* used for accessibility */
"CloseTabButtonHelpText" = "Close this tab";

/* Rendezvous messages */
"NoServicesFound"="(No Services Found)";
"ServiceResolutionFailedTitle"="Could not connect";
"ServiceResolutionFailedMsgFormat"="There was a problem trying to connect to “%@”.";
"_ftp._tcp."=" (ftp)";
"_http._tcp."=" (http)";
"_https._tcp."=" (ftp)";
"UserNameRequestTitle"="FTP Login";
"UsernameRequestFormat"="Enter a username to access the FTP server “%@”. Leave blank to use anonymous login.";

/* Password Dialogs */
"Username Label" = "Username:";
"Password Label" = "Password:";

/* Security dialogs */
"ContinueButton" = "Continue";
"StopButton" = "Don’t Connect";
"Accept Always" = "Always Accept";
"Accept Once" = "Accept Once";
"Security Warning" = "Security Warning";
"Post To Insecure" = "The information you have entered will be sent over an unencrypted connection and could easily be read by a third party.\n\nAre you sure you want to continue sending this information?";

/* cookie dialog */
"CookieText" = "%@ wants to set a cookie. Do you want to allow it?";
"CookieCheckbox" = "Remember this decision?";
"CookieTitle" = "Allow Cookie?";
"Allow" = "Allow";
"Deny" = "Deny";
"Allow for Session" = "Allow for Session";

/* Popup Blocking */
"PopupDisplayRequest" = "%@ wants to show a pop-up";
"GenericHostString" = "This site";

/* for toggling between page/bookmark info Edit menu item */
"Page Info" = "Show Page Info";
"Bookmark Info" = "Show Bookmark Info"; /* also used for the bookmark item context menu */

/* Bookmark undo menu messages */
"Add Folder" = "Add Folder";
"Add Bookmark" = "Add Bookmark";
"Add Separator" = "Add Separator";
"Move Folder" = "Move Folder";
"Move Bookmark" = "Move Bookmark";
"Move Separator" = "Move Separator";
"Copy Folder" ="Copy Folder";
"Copy Bookmark" = "Copy Bookmark";
"Delete Bookmark" = "Delete Bookmark";
"Delete Separator" = "Delete Separator";
"Delete Folder" = "Delete Folder";
"Arrange Bookmarks" = "Arrange";

"Arrange Increasing by title" = "↑ by Title";
"Arrange Decreasing by title" = "↓ by Title";
"Arrange Increasing by location" = "↑ by Location";
"Arrange Decreasing by location" = "↓ by Location";

/* Bookmark menu spacer */
"<Menu Spacer>" = "<Menu Spacer>";

/* Bookmarks edit panel */
"Bookmark Manager" = "Bookmarks Manager";
"BookmarkInfoTitle" = "Info for ‘%@’";
"BlankBookmarkInfoTitle" = "Bookmark Info";
"BookmarkVisitedNever" = "Never";
"NewBookmarkFolder" = "New Folder";
"BookmarksRootName" = "Bookmarks"; /* root of folders menu in Add Bookmark dialog */
"OK" = "OK";
"BookmarksWindowTitle" = "Bookmarks";
"HistoryWindowTitle" = "History";

/*Bookmark outline view*/
"Contains Items" = "%u Items";

/* Used when bookmarking multiple tabs; most likely you will only need to localize the word tabs and the order of %d and tabs. */
"defaultTabGroupTitle" = "[%d tabs] %@";

/* Parser error loading bookmarks.plist file */
"CorruptedBookmarksAlert" = "Error Reading Bookmarks";
"CorruptedBookmarksMsg"   = "Your bookmarks file is damaged and could not be read.";

/* Error importing bookmarks */
"ImportFailureTitle" = "Import Failed";
"ImportFailureMessage" = "The file “%@” is not a supported bookmark file type.";

/*Bookmark Importing*/
"Import Bookmarks" = "Import Bookmarks";
"ImportPanelButton" = "Import";
"Imported IE Favorites" = "Imported IE Favorites";
"Imported %@ Bookmarks" = "Imported %@ Bookmarks";
"Imported Bookmarks" = "Imported Bookmarks";
"Imported OmniWeb 5 Bookmarks" = "Imported OmniWeb 5 Bookmarks";
"OmniWeb Favorites" = "OmniWeb Favorites";
"OmniWeb Published" = "OmniWeb Published";

"Export" = "Export";
"ExportedBookmarkFile" = "ExportedCaminoBookmarks";

/*New Collections */
"Bookmark Menu" = "Bookmark Menu";
"Bookmark Bar" = "Bookmark Bar";
"History" = "History";
"Top Ten List" = "Top Ten List";
"Broken Bookmarks" = "Broken Bookmarks";
"Updated Bookmarks" = "Updated Bookmarks";
"Rendezvous" = "Bonjour";
"Address Book" = "Address Book";
/* Used when no person name is found for an Address Book smart bookmark */
"<No Name>" = "<No Name>";
/* Used when no company name is found for an Address Book smart bookmark based on a Company card */
"<No Company Name>" = "<No Company Name>";
/* Used for a Company card that has a person's name associated with it (e.g. "Google (John Doe)") */
"CompanyCardWithPersonNameFormat" = "%1$@ (%2$@)";

/*Bookmark context menus*/
"Open in New Window" = "Open in New Window";
"Open in New Windows" = "Open in New Windows";
"Open in New Tab" = "Open in New Tab";
"Open in New Tabs" = "Open in New Tabs";
"Open Tabs in New Window" = "Open Tabs in New Window";
"Open in Tabs in New Window" = "Open in Tabs in New Window";
"Open in Tabs" = "Open in Tabs";
"Create New Folder..." = "Create New Folder…";
"Create New Folder" = "Create New Folder";
"Delete" = "Delete";
"Use as Dock Menu" = "Use as Dock Menu";
"Copy URL to Clipboard" = "Copy Location to Clipboard";
"Copy URLs to Clipboard" = "Copy Locations to Clipboard";
"Reveal in Bookmark Manager" = "Reveal in Bookmark Manager";

/* Page Info */
"WebSiteVerified" = "Website identity verified";
"WebSiteVerifiedMixed" = "Website identity verified, but not all content is secure";
"WebSiteNotVerified" = "Website identity not verified";
"WebSiteVerifiedDetailsFormat" = "The identity of the website “%1$@” has been verified by “%2$@”, who issued its security certificate.";
"WebSiteVerifiedMixedDetailsFormat" = "The identity of the website “%1$@” has been verified by “%2$@”, who issued its security certificate, but some parts of this page came from an unverified source.";

"ConnectionMixedContent" = "Connection Partially Encrypted";
"ConnectionMixedContentDetails" = "Parts of this page were not encrypted before being transmitted over the Internet.";

"ConnectionStrongEncryptionFormat" = "Connection Encrypted: High-grade Encryption (%@ %d bit)";
"ConnectionStrongEncryptionDetails" = "This page was encrypted before being transmitted over the Internet.";

"ConnectionWeakEncryptionFormat" = "Connection Encrypted: Low-grade Encryption (%@ %d bit)";
"ConnectionWeakEncryptionDetails" = "This page was encrypted with low-grade encryption before being transmitted over the Internet.";

"ConnectionNoneEncryption" = "Connection Not Encrypted";
"ConnectionNoneEncryptionDetails" = "This page was not encrypted before being transmitted over the Internet.";


/* Reset feature */
"Reset Camino Title" = "Are you sure you want to reset Camino?";
"Reset Warning Message" = "Resetting Camino will erase your browsing history, empty the cache, clear downloads, clear all cookies and site cookie permissions, and remove any passwords Camino saved in your Keychain.\n\nYou cannot undo this action.\n";
"Reset Camino" = "Reset Camino";
"DontResetButtonText" = "Don’t Reset";

/* History labels */
"Tomorrow" = "Tomorrow";
"Today" = "Today";
"TopLevelHistoryMenuEarlierToday" = "Earlier Today";
"Yesterday" = "Yesterday";
"HistoryMoreThanAWeek" = "More than a week ago";
"LocalFilesCategoryTitle" = "Local Files";
"RecentlyClosed" = "Recently Closed Pages";

/* Most likely the only thing you need to do here is change the ordering. The string should only include the name of the day of the week (%A), day of the month as a number (%d), and name of the month (%B). */
"HistoryMenuDateFormat" = "%A, %B %d";

/* Empty cache messages */
"EmptyCacheTitle" = "Are you sure you want to empty the cache?";
"EmptyCacheMessage" = "Camino saves the contents of web pages you visit in a cache so that they load more quickly on future visits.\n\nYou cannot undo this action.\n";
"EmptyCacheButtonText" = "Empty Cache";
"DontEmptyButtonText" = "Don’t Empty";

/* Clear history message */
"ClearHistoryMenuItem" = "Clear History…";
"ClearHistoryTitle" = "Are you sure you want to clear the history?";
"ClearHistoryMessage" = "Clearing your history will erase the list of sites that you have visited. You won’t be able to autocomplete the URLs of these sites when typing in the location bar.\n\nYou cannot undo this action.\n";
"ClearHistoryButtonText" = "Clear History";
"DontClearButtonText" = "Don’t Clear";

"ShowMoreHistoryMenuItem" = "Show More";

/* mailto: link menu options */
"Open %@ in Address Book" = "Open %@ in Address Book";
"Add %@ to Address Book" = "Add %@ to Address Book";
"Copy Addresses" = "Copy Addresses";

/* used in default browser selection */
"Application does not exist" = "Application does not exist";
"BrowserDoesNotExistExplanation" = "The default browser you have chosen no longer exists. Please choose another browser.";

/* Spelling UI */
"SpellingSubmenu" = "Spelling";
"SpellingPanel" = "Spelling…";
"CheckSpelling" = "Check Spelling";
"CheckSpellingAsYouType" = "Check Spelling as You Type";
"CheckSpellingWhileTyping" = "Check Spelling While Typing";
"SpellingLanguage" = "Spelling Language";

/* Page contextual menus */
"No Guesses Found" = "No Guesses Found";
"LearnSpelling" = "Learn Spelling";
"IgnoreSpelling" = "Ignore Spelling";
"Action in New Tab" = "%@ in New Tab";
"Action in New Window" = "%@ in New Window";

/* Find bar strings */
"TextNotFound" = "Not found";
"CloseFindBarTitle" = "Close the find bar";

/* Web Search Engines */
"ManageSearchEnginesMenuItem" = "Manage Search Engines…";
"FindSearchEnginesMenuItem" = "Find Search Engines…";
"EngineNameAlreadyExistsTitle" = "Search engine name already exists";
"EngineNameAlreadyExistsMessage" = "A search engine named “%@” already exists.  Please specify a different name.";
"RemovingAllEnginesTitle" = "Cannot remove all search engines";
"RemovingAllEnginesMessage" = "Camino needs at least one search engine to be installed.";
"RestoreDefaultEnginesTitle" = "Restore the default search engines?";
"RestoreDefaultEnginesMessage" = "Restoring the default search engines will replace all of the engines that are currently installed.\n\nYou cannot undo this action.\n";
"RestoreDefaultEnginesActionButton" = "Restore Default Engines";
"DontRestoreDefaultEnginesActionButton" = "Don’t Restore";

/* Web Search Plug-ins */
"InstallSearchPluginMenuItem" = "Add “%@”";
"SearchPluginInstallationErrorTitle" = "Problem adding the search engine.";
"SearchPluginInstallationErrorMessage" = "Camino was unable to add “%1$@” to the web search field. %2$@";
"UnknownSearchPluginName" = "Unknown Plug-in";
"SearchPluginInstallationConfirmationTitle" = "Add search engine?";
"SearchPluginInstallationConfirmationMessage" = "Would you like to add the search engine “%@” to the search field?";
"SearchPluginInstallationConfirmButton" = "Add";
"SearchPluginInstallationCancelButton" = "Don’t Add";
"SearchPluginAlreadyInstalledTitle" = "Duplicate search engine.";
"SearchPluginAlreadyInstalledMessage" = "The search engine “%@” is already installed.";

/* XMLSearchPluginParser Error Descriptions: */
"XMLSearchPluginParserInvalidPluginFormat" = "The search plug-in is in an unrecognized or unsupported format.";
"XMLSearchPluginParserPluginNotFound" = "The search plug-in could not be found on the server.";
"XMLSearchPluginParserUnsupportedSearchURL" = "The search method used by this plug-in is not yet supported.";
"XMLSearchPluginParserUnknownError" = "The search plug-in could be unavailable or in an unsupported format.";

/* Auto-Update */
"AutoUpdateDisabledToolTip" = "Automatic updates are available in official builds";

/* Protocol Handling */
"UnknownContentHandler" = "Unknown Application";
"OpenExternalHandlerTitle" = "Open this link with “%@”?";
"OpenExternalHandlerText" = "Camino cannot open “%@” links. Do you want to open this link with the application “%@”?";
"OpenExternalHandlerRemember" = "Always open “%@” links without asking";
"OpenExternalHandlerOpenButon" = "Open with “%@”";
"OpenExternalHandlerCancelButton" = "Don’t Open";
"NoExternalHandlerTitle" = "Unknown link type";
"NoExternalHandlerText" = "Camino cannot open “%@” links, and there are no other applications installed that can open these links.";

/* Growl */
"GrowlDownloadStarted" = "Download Started";
"GrowlDownloadFailed" = "Download Failed";
"GrowlDownloadComplete" = "Download Complete";
"GrowlShortDownloadComplete" = "Short Download Complete";

/* Safe Browsing */
/* Please translate these strings with care, because we are required to
   indicate that the protection provided by this feature is not perfect.
   Specifically, not all malicious sites will be identified, and some sites may
   falsely be indentifed as malicious, so warning messages should indicate
   these are “suspected” or “reported” to be dangerous and that they “possibly” or
   “may” steal your data. */
"PhishingTitleText" = "Reported Phishing Site";
"MalwareTitleText" = "Reported Malware Site";
/* For the short descriptions, please do not translate the contents of the <span> tags. 
   They will be replaced at runtime with a domain name. */
"PhishingShortDescText" = "This web site at <span id='phishing_sitename'/> has been reported as a phishing site and has been blocked for your protection.";
"MalwareShortDescText" = "This web site at <span id='malware_sitename'/> has been reported as a malware site and has been blocked for your protection.";
/* To create paragraphs within the long description text, please wrap each 
   paragraph in <p></p> tags.  Because these strings appear in an XHTML page, 
   each LongDescText string must begin with a <p> and end with a </p> or the 
   safe browsing page will not display. */
"PhishingLongDescText" = "<p>Phishing sites are designed to trick you into revealing personal or financial information by creating copies of trusted websites.</p><p>Entering any information on this web page may result in identity theft or other fraud.</p>";
"MalwareLongDescText" = "<p>Malware sites try to install programs that steal private information, use your computer to attack others, or damage your system.</p><p>Some malware sites intentionally distribute harmful software, but many are compromised without the knowledge or permission of their owners.</p><p>Your computer can be infected just by proceeding to this site, without any further action on your part.</p>";
"MoreInformationFormat" = "For more information about why this site was blocked, see Camino’s <a href='%@'>Safe Browsing Documentation</a>.";
"GetMeOutButtonLabel" = "Close Page";
"IgnoreWarningButtonLabel" = "Ignore This Warning";
"PhishReportingDisabledToolTip" = "“Warn me when visiting potentially malicious sites” must be enabled to report phishing pages.";

/* Gecko Print Dialog; only needed for Gecko 1.9.2 */
"Options:" = "Options:";
"Print Selection Only" = "Print Selection Only";
"Ignore Scaling and Shrink To Fit Page Width" = "Ignore Scaling and Shrink To Fit Page Width";

"Appearance:" = "Appearance:";
"Print Background Colors" = "Print Background Colors";
"Print Background Images" = "Print Background Images";

"Frames:" = "Frames:";
"As Laid Out on the Screen" = "As Laid Out on the Screen";
"The Selected Frame" = "The Selected Frame";
"Each Frame on Separate Pages" = "Each Frame on Separate Pages";

"Page Headers:" = "Page Headers:";
"Page Footers:" = "Page Footers:";
"Left" = "Left";
"Center" = "Center";
"Right" = "Right";
"--blank--" = "--blank--";
"Title" = "Title";
"URL" = "URL";
"Date/Time" = "Date/Time";
"Page #" = "Page #";
"Page # of #" = "Page # of #";

/* Certificate Error Page */
CertErrorTitleText = "Untrusted Connection";
CertErrorPageHeadingText = "The identity of this site can’t be verified";

/* The string "#1" will be replaced at runtime with the name of the server to
   which the user was trying to connect. */
CertErrorIntroPara1 = "You have asked Camino to connect securely to <b>#1</b>, but Camino can’t confirm that you are connecting to that site.";
CertErrorIntroPara2 = "When you try to connect securely, sites will present identification to prove that you are going to the right place. However, this site’s identity can’t be verified by any Certificate Authority trusted by Camino.";

CertErrorAdviceHeadingText = "What Should I Do?";
CertErrorAdviceText = "If you usually connect to this site without problems, or if you have never connected before, this error could mean that someone is trying to impersonate the site, and you should not continue.";
CertErrorGetMeOutButtonLabel = "Leave Site";

CertErrorTechnicalHeading = "Technical Details";

CertErrorExpertHeadingText = "I Understand the Risks";
CertErrorExpertPara1 = "If you understand what’s going on, you can tell Camino to start trusting this site’s identification. <b>Even if you believe this is a trustworthy site, this error could mean that someone is tampering with your connection.</b>";
CertErrorExpertPara2 = "You should not add an exception if you are using an internet connection that you do not trust completely, if you are not used to seeing a warning for this site, or if you do not know that there is a good reason why this site does not use identification that can be verified.";
AddExceptionButtonLabel = "Add Exception…";
